{
  "animals": [
    {
      "name": "Ant",
      "icon": "ic_ant",
      "background": "bg_ant",
      "description": "Ants are eusocial insects of the family Formicidae and, along with the related wasps and bees, belong to the order Hymenoptera. Ants appear in the fossil record across the globe in considerable diversity during the latest Early Cretaceous and early Late Cretaceous, suggesting an earlier origin. Ants evolved from vespoid wasp ancestors in the Cretaceous period, and diversified after the rise of flowering plants. More than 13,800 of an estimated total of 22,000 species have been classified. They are easily identified by their geniculate (elbowed) antennae and the distinctive node-like structure that forms their slender waists.\n\nAnts form colonies that range in size from a few dozen predatory individuals living in small natural cavities to highly organised colonies that may occupy large territories and consist of millions of individuals. Larger colonies consist of various castes of sterile, wingless females, most of which are workers (ergates), as well as soldiers (dinergates) and other specialised groups. Nearly all ant colonies also have some fertile males called \"drones\" and one or more fertile females called \"queens\" (gynes). The colonies are described as superorganisms because the ants appear to operate as a unified entity, collectively working together to support the colony."
    },
    {
      "name": "Cat",
      "icon": "ic_cat",
      "background": "bg_cat",
      "description": "The cat (Felis catus) is a domestic species of small carnivorous mammal. It is the only domesticated species in the family Felidae and is often referred to as the domestic cat to distinguish it from the wild members of the family. A cat can either be a house cat, a farm cat or a feral cat; the latter ranges freely and avoids human contact. Domestic cats are valued by humans for companionship and their ability to kill rodents. About 60 cat breeds are recognized by various cat registries.\n\nThe cat is similar in anatomy to the other felid species: it has a strong flexible body, quick reflexes, sharp teeth and retractable claws adapted to killing small prey. Its night vision and sense of smell are well developed. Cat communication includes vocalizations like meowing, purring, trilling, hissing, growling and grunting as well as cat-specific body language. A predator that is most active at dawn and dusk (crepuscular), the cat is a solitary hunter but a social species. It can hear sounds too faint or too high in frequency for human ears, such as those made by mice and other small mammals. It secretes and perceives pheromones."
    },
    {
      "name": "Dog",
      "icon": "ic_dog",
      "background": "bg_dog",
      "description": "The dog or domestic dog, (Canis familiaris or Canis lupus familiaris) is a domesticated descendant of the wolf which is characterized by an upturning tail. The dog derived from an ancient, extinct wolf, and the modern grey wolf is the dog's nearest living relative. The dog was the first species to be domesticated, by hunter–gatherers over 15,000 years ago, before the development of agriculture.\n\nDue to their long association with humans, dogs have expanded to a large number of domestic individuals[10] and gained the ability to thrive on a starch-rich diet that would be inadequate for other canids.[11] Over the millennia, dogs became uniquely adapted to human behavior, and the human-canine bond has been a topic of frequent study."
    },
    {
      "name": "Dolphin",
      "icon": "ic_dolphin",
      "background": "bg_dolphin",
      "description": "Dolphin is the common name of aquatic mammals within the infraorder Cetacea. The term dolphin usually refers to the extant families Delphinidae (the oceanic dolphins), Platanistidae (the Indian river dolphins), Iniidae (the New World river dolphins), Pontoporiidae (the brackish dolphins), and the extinct Lipotidae (baiji or Chinese river dolphin). There are 40 extant species named as dolphins.\n\nDolphins range in size from the relatively small 1.7-metre-long (5 ft 7 in) long and 50-kilogram (110-pound) bodied Maui's dolphin to the 9.5 m (31 ft 2 in) and 10-tonne (11-short-ton) killer whale. Dolphins can sometimes leap about 30 feet (9.1 m). Several species of dolphins exhibit sexual dimorphism, in that the males are larger than females. They have streamlined bodies and two limbs that are modified into flippers. Though not quite as flexible as seals, some dolphins can travel at speeds 29 kilometres (18 mi) per hour for short distances. Dolphins use their conical shaped teeth to capture fast-moving prey. They have well-developed hearing which is adapted for both air and water and is so well developed that some can survive even if they are blind. Some species are well adapted for diving to great depths. They have a layer of fat, or blubber, under the skin to keep warm in the cold water."
    },
    {
      "name": "Eagle",
      "icon": "ic_eagle",
      "background": "bg_eagle",
      "description": "Eagle is the common name for many large birds of prey of the family Accipitridae. Eagles belong to several groups of genera, some of which are closely related. Most of the 60 species of eagle are from Eurasia and Africa. Outside this area, just 14 species can be found—2 in North America, 9 in Central and South America, and 3 in Australia.\n\nEagles are not a natural group but denote essentially any bird of prey large enough to hunt sizeable (about 50 cm long or more overall) vertebrate prey."
    },
    {
      "name": "Elephant",
      "icon": "ic_elephant",
      "background": "bg_elephant",
      "description": "Elephants are the largest existing land animals. Three living species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant. They are an informal grouping within the proboscidean family Elephantidae. Elephantidae is the only surviving family of proboscideans; extinct members include the mastodons. Elephantidae also contains several extinct groups, including the mammoths and straight-tusked elephants. African elephants have larger ears and concave backs, whereas Asian elephants have smaller ears, and convex or level backs. Distinctive features of all elephants include a long proboscis called a trunk, tusks, large ear flaps, massive legs, and tough but sensitive skin. The trunk is used for breathing, bringing food and water to the mouth, and grasping objects. Tusks, which are derived from the incisor teeth, serve both as weapons and as tools for moving objects and digging. The large ear flaps assist in maintaining a constant body temperature as well as in communication. The pillar-like legs carry their great weight.\n\nElephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia and are found in different habitats, including savannahs, forests, deserts, and marshes. They are herbivorous, and they stay near water when it is accessible. They are considered to be keystone species, due to their impact on their environments. Elephants have a fission–fusion society, in which multiple family groups come together to socialise. Females (cows) tend to live in family groups, which can consist of one female with her calves or several related females with offspring. The groups, which do not include bulls, are usually led by the oldest cow, known as the matriarch."
    },
    {
      "name": "Hippo",
      "icon": "ic_hippo",
      "background": "bg_hippo",
      "description": "The hippopotamus (/ˌhɪpəˈpɒtəməs/ HIP-ə-POT-ə-məs; Hippopotamus amphibius), also called the hippo, common hippopotamus or river hippopotamus, is a large, mostly herbivorous, semiaquatic mammal and ungulate native to sub-Saharan Africa. It is one of only two extant species in the family Hippopotamidae, the other being the pygmy hippopotamus (Choeropsis liberiensis or Hexaprotodon liberiensis). The name comes from the ancient Greek for \"river horse\" (ἱπποπόταμος).\n\nAfter the elephant and rhinoceros, the hippopotamus is the third-largest type of land mammal and is the heaviest extant artiodactyl (in the traditional, non-cladistic sense of the term, excluding cetaceans). Despite their physical resemblance to pigs and other terrestrial even-toed ungulates, the closest living relatives of the Hippopotamidae are cetaceans (whales, dolphins, porpoises, etc.), from which they diverged about 55 million years ago. Hippos are recognisable by their barrel-shaped torsos, wide-opening mouths revealing large canine tusks, nearly hairless bodies, columnar legs and large size; adults average 1,500 kg (3,310 lb) for males and 1,300 kg (2,870 lb) for females. Despite its stocky shape and short legs, it is capable of running 30 km/h (19 mph) over short distances.\n\nHippos inhabit rivers, lakes, and mangrove swamps, where territorial males preside over a stretch of river and groups of five to thirty females and young hippos. During the day, they remain cool by staying in the water or mud; reproduction and birth both occur in water. They emerge at dusk to graze on grasses. While hippos rest near each other in the water, grazing is a solitary activity and hippos are not territorial on land. The hippo is among the most dangerous animals in the world due to its highly aggressive and unpredictable nature. They are threatened by habitat loss and poaching for their meat and ivory canine teeth."
    },
    {
      "name": "Jellyfish",
      "icon": "ic_jellyfish",
      "background": "bg_jellyfish",
      "description": "Jellyfish and sea jellies are the informal common names given to the medusa-phase of certain gelatinous members of the subphylum Medusozoa, a major part of the phylum Cnidaria. Jellyfish are mainly free-swimming marine animals with umbrella-shaped bells and trailing tentacles, although a few are anchored to the seabed by stalks rather than being mobile. The bell can pulsate to provide propulsion for highly efficient locomotion. The tentacles are armed with stinging cells and may be used to capture prey and defend against predators. Jellyfish have a complex life cycle; the medusa is normally the sexual phase, which produces planula larva that disperse widely and enter a sedentary polyp phase before reaching sexual maturity.\n\nJellyfish are found all over the world, from surface waters to the deep sea. Scyphozoans (the \"true jellyfish\") are exclusively marine, but some hydrozoans with a similar appearance live in freshwater. Large, often colorful, jellyfish are common in coastal zones worldwide. The medusae of most species are fast-growing, and mature within a few months then die soon after breeding, but the polyp stage, attached to the seabed, may be much more long-lived. Jellyfish have been in existence for at least 500 million years, and possibly 700 million years or more, making them the oldest multi-organ animal group."
    },
    {
      "name": "Owl",
      "icon": "ic_owl",
      "background": "bg_owl",
      "description": "Owls are birds from the order Strigiformes (/ˈstrɪdʒəfɔːrmiːz/), which includes over 200 species of mostly solitary and nocturnal birds of prey typified by an upright stance, a large, broad head, binocular vision, binaural hearing, sharp talons, and feathers adapted for silent flight. Exceptions include the diurnal northern hawk-owl and the gregarious burrowing owl.\n\nOwls hunt mostly small mammals, insects, and other birds, although a few species specialize in hunting fish. They are found in all regions of the Earth except the polar ice caps and some remote islands.\n\nOwls are divided into two families: the true (or typical) owl family, Strigidae, and the barn-owl family, Tytonidae.\n\nA group of owls is called a \"parliament\"."
    },
    {
      "name": "Pigeon",
      "icon": "ic_pigeon",
      "background": "bg_pigeon",
      "description": "Columbidae (/kəˈlʌmbɪdiː/) is a bird family consisting of pigeons and doves. It is the only family in the order Columbiformes. These are stout-bodied birds with short necks, and short slender bills that in some species feature fleshy ceres. They primarily feed on seeds, fruits, and plants. The family occurs worldwide, but the greatest variety is in the Indomalayan and Australasian realms.\n\nThe family contains 344 species divided into 50 genera. Thirteen of the species are extinct.\n\nIn English, the smaller species tend to be called \"doves\" and the larger ones \"pigeons\". However, the distinction is not consistent, and does not exist in most other languages. Historically, the common names for these birds involve a great deal of variation between the terms. The bird most commonly referred to as just \"pigeon\" is the domestic pigeon, which is common in many cities as the feral pigeon.\n\nPigeon is a French word that derives from the Latin pipio, for a \"peeping\" chick, while dove is an ultimately Germanic word that refers to the bird's diving flight. The English dialectal word culver appears to derive from Latin columba. A group of doves is called a \"dule\", taken from the French word deuil ('mourning').\n\nDoves and pigeons build relatively flimsy nests, often using sticks and other debris, which may be placed on branches of trees, on ledges, or on the ground, depending on species. They lay one or (usually) two white eggs at a time, and both parents care for the young, which leave the nest after 25–32 days. Unfledged baby doves and pigeons are called squabs and are generally able to fly by 5 weeks of age. These fledglings, with their immature squeaking voices, are called squeakers once they are weaned or weaning. Unlike most birds, both sexes of doves and pigeons produce \"crop milk\" to feed to their young, secreted by a sloughing of fluid-filled cells from the lining of the crop."
    },
    {
      "name": "Tortoise",
      "icon": "ic_tortoise",
      "background": "bg_tortoise",
      "description": "Tortoises (/ˈtɔːr.təs.ɪz/) are reptiles of the family Testudinidae of the order Testudines (Latin: tortoise). They are particularly distinguished from other turtles (which includes the order Chelonia) by being exclusively land-dwelling, while many (though not all) other turtle species are at least partly aquatic. Like other turtles, tortoises have a shell to protect from predation and other threats. The shell in tortoises is generally hard, and like other members of the suborder Cryptodira, they retract their necks and heads directly backwards into the shell to protect them.\n\nTortoises can vary in size with some species, such as the Galápagos giant tortoise, growing to more than 1.2 metres (3.9 ft) in length, whereas others like the Speckled cape tortoise have shells that measure only 6.8 centimetres (2.7 in) long. Several lineages of tortoises have independently evolved very large body sizes in excess of 100 kg, including the Galapagos giant tortoise and the Aldabra giant tortoise. They are usually diurnal animals with tendencies to be crepuscular depending on the ambient temperatures. They are generally reclusive animals. Tortoises are the longest-living land animals in the world, although the longest-living species of tortoise is a matter of debate. Galápagos tortoises are noted to live over 150 years, but an Aldabra giant tortoise named Adwaita may have lived an estimated 255 years. In general, most tortoise species can live 80–150 years.\n\nTortoises are placid and very slow moving, with an average walking speed of 0.2–0.5 km/h."
    }
  ]
}